eNum_1_0_1_1/DataProcessors/ун30_ПанельУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ун30_ПанельУправления</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДокументыНумерации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантНумерации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

eNum_1_0_1_1/InformationRegisters/ун30_ОбъектыНумерации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ун30_ОбъектыНумерации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантНумерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Включить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перезаписывать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

eNum_1_0_1_1/DataProcessors/ун30_ПанельУправления/Ext/ObjectModule.bsl
Процедура ИнициализироватьДокументыНумерации() Экспорт
	
	ДокументыНумерации.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ун30_ОбъектыНумерации.ИмяДокумента КАК ИмяДокумента,
	|	ун30_ОбъектыНумерации.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|	ун30_ОбъектыНумерации.Включить КАК Включить,
	|	ун30_ОбъектыНумерации.ВариантНумерации КАК ВариантНумерации
	|ИЗ
	|	РегистрСведений.ун30_ОбъектыНумерации КАК ун30_ОбъектыНумерации";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДокументыНумерации.Добавить(), Выборка);
	КонецЦикла;
	
	Для каждого мдДокумент Из Метаданные.Документы Цикл
		Если ДокументыНумерации.Найти(мдДокумент.Имя, "ИмяДокумента") = Неопределено Тогда
			НС = ДокументыНумерации.Добавить();
			НС.ИмяДокумента = мдДокумент.Имя;
			НС.ПредставлениеДокумента = мдДокумент.Представление();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


Функция ИнициализироватьБазовыеНастройки(БазовыеНастройки)
	
	Результат = Новый Структура;
	
	Массив1 = СтрРазделить(БазовыеНастройки, "~");
	
	Для каждого ИмяНастройки Из Массив1 Цикл
		Подмассив = СтрРазделить(ИмяНастройки, "&");
		Результат.Вставить(ИмяНастройки, Подмассив[1]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
